{
    "name": "Appraise",
    "description": "Use this skill to tell an antique from old junk, a sword that's old and fancy from an elven heirloom, and high-quality jewelry from cheap stuff made to look good. You can also appraise the quality of a performance, a written work, and similar artistic endeavors.",
    "key_ability": "Int",
    "trained_only": false,
    "armor_check_penalty": false,
    "check": "You can appraise common or well-known objects with a DC 12 Appraise check. Failure means that you estimate the value at 50% to 150% (2d6+3 times 10%) of its actual value. Appraising a rare or exotic item requires a successful check against DC 15, 20, or higher. If the check is successful, you estimate the value correctly; failure means you cannot estimate the item's value.",
    "action": "Appraising an item takes 1 minute (ten consecutive full-round actions).",
    "try_again": "No. If you attempt a normal Appraise check, you cannot try again on the same object, regardless of success. If you fail to appraise an item quickly, you can still try to appraise the item normally.",
    "special": [
        {
            "name": "Dwarven Appraisal",
            "description": "A dwarf gets a +2 racial bonus on Appraise checks that are related to stone or metal items.",
            "data": {
                "bonus_type": "racial",
                "item_type": "stone/metal",
                "value": 2
            }
        },
        {
            "name": "Familiar bonus",
            "description": "The master of a raven familiar gains a +3 bonus on Appraise checks.",
            "data": {
                "bonus_type": "familiar",
                "familiar_type": "raven",
                "value": 3
            }
        },
        {
            "name": "Diligent Feat",
            "description": "A character with the Diligent feat gets a +2 bonus on Appraise checks.",
            "data": {
                "bonus_type": "feat",
                "feat_type": "Diligent",
                "value": 2
            }
        }
    ],
    "synergy": [
        {
            "skill": "Craft",
            "bonus": "+2 on appraise checks relating to items of that specific craft type"
        },
        {
            "skill": "Perform",
            "bonus": "+2 on Appraise checks related to performances using that Perform skill"
        }
    ],
    "restriction": "None.",
    "untrained": "For common items, failure on an untrained check means no estimate. For rare items, success means an estimate of 50% to 150% (2d6+3 times 10%)."
}