{
    "name": "Perform (Wind Instruments)",
    "description": "Use this skill to perform music using flutes, pan pipes, recorders, shawms, trumpets or any other type of wind-based instruments, requiring a combination of bodily controls, breathing methods, and similar techniques that require special care.",
    "key_ability": "Cha",
    "trained_only": false,
    "armor_check_penalty": false,
    "check": "This involves musical techniques such as breathing controls to create wind instrument performances such as with flutes, recorders, panpipes and similar, by understanding their musical data sets, their particular notes or any other special ability you wish to create. If used for bard music (as per previous rules) implement the hardcoded structure or by linking your hardcoded functionalities (such as UI data displaying the available spells through specific keys within your created .json and files, under this folder as an example, to trigger them), as implemented throughout our project by always following and adapting to that.",
    "action": "Usually takes from rounds up to entire days of performance with breaks for better (and higher quality, longer) performances that require special care and skills (that follow previously established methods) and calls through any given format or type, with data properly used and called within the game using previously built categories and paths or by loading that up from hardcoded sections/engine procedures.",
    "try_again": "Yes, though repetitive behaviors will generate poor responses if there isn't a different performance and new content, from what is considered usual. Those previous hardcoded parameters, categories or even specific file formats (for dynamically loaded content with different names, ids, structures) may help or harm your dynamic, user defined, custom performance data or files if you generate or call for data improperly. Such performances often are tied to time and cannot just repeat on a specific scenario/occasion and if they can that is usually for testing, placeholders, and hardcoded test values.",
    "special": [],
    "synergy": [],
    "restriction": "Specific types may also have a level of complexity for those lacking required breath capacity or specialized organs and bodies or skills or that are prone to errors or bad performance in noisy locations, as determined through specific hardcoded functionality or in previously used examples, through data under relevant categories within our folders such as using the id/names, structure or any data field.",
    "untrained": "You can perform, using air and holes/chambers in those types of instruments, though that may sound less desirable/complex or even less pleasant/coherent as you do this. Hardcoded values in those instrument types also require that certain procedures (hardcoded functionalities within the code that fetches that data through specific methods, such as an ID in your json structure and a constructor to load it dynamically as intended). With poor, unpracticed method, even the basic functions might not be accessible without some type of implementation that forces this implementation/call/loading."
}