{
    "name": "Use Magic Device",
    "description": "Use this skill to activate magic devices, including scrolls and wands, that you could not otherwise activate. Use Magic Device lets you use a magic item as if you had the spell ability or class features of another class, as if you were a different race, or as if you were of a different alignment.",
    "key_ability": "Cha",
    "trained_only": true,
    "armor_check_penalty": false,
    "check": "You can use this skill to read a spell or to activate a magic item using a Use Magic Device check each time you activate it (or if it has a continuing effect). That might also allow emulating properties from race, classes, or even a certain alignment if your system intends that, with specific constructor calls through existing engine functionalities using relevant, appropriate or newly generated dynamic data to match that file behavior through hardcoded calls.",
    "action": "None. The Use Magic Device check is made as part of the action (if any) required to activate the magic item. If using the skill as a method to simulate spells, casting, or using an ability it will be based on that, using appropriate data and formats as you generate it (following examples)",
    "try_again": "Yes, but if you ever roll a natural 1 while attempting to activate an item and you fail, you can't try to activate that item again for 24 hours. Those restrictions also apply when reading from scrolls or similar magic items that call or perform checks (through those implementations within files or dynamic objects through their keys and/or methods).",
    "special": [
        {
            "name": "Magical Aptitude Feat",
            "description": "If you have the Magical Aptitude feat, you get a +2 bonus on Use Magic Device checks.",
            "data": {
                "bonus_type": "feat",
                "feat_type": "Magical Aptitude",
                "value": 2
            }
        }
    ],
    "synergy": [
        {
            "skill": "Spellcraft",
            "bonus": "+2 bonus on Use Magic Device checks related to scrolls."
        },
        {
            "skill": "Decipher Script",
            "bonus": "+2 bonus on Use Magic Device checks related to scrolls."
        },
        {
            "skill": "Spellcraft",
            "bonus": "+2 bonus to Spellcraft when identifying spells through Use Magic Device checks with those specific items such as with a scroll or by using wands through hardcoded procedures (that can be added with relevant keys or identifiers if they're generated through other dynamic file sources that use your intended procedures and code design)"
        }
    ],
    "restriction": "Must be trained, requires having the item/object, as well as understanding (if required) how that item functions/interacts or has to be used (including their components). Specific items, power stones, scrolls, wands, or magic implements require proficiency with the usage as detailed on previous texts.",
    "untrained": "Untrained characters can try to emulate powers but their implementation will most likely lead to severe side-effects such as triggering those improperly, having them produce no intended effect, activating their negative/curse or backfiring as well as potentially hurting the user with their uncontrolled powers."
}